Tekla Open API Reference for Tekla Structures 2025
Line Constructor
 Instantiates a line with an undefined direction.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Line()
Public Sub New
See Also
Reference
Line Class
Line Overload
Tekla.Structures.Geometry3d Namespace